cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'heroku/brew'
tap 'homebrew/cask'
tap 'homebrew/cask-drivers' # Logitech options

# Libraries & Utilities
brew 'stow' # for nokogiri
brew 'libxml2' # for nokogiri
brew 'coreutils'
brew 'sqlite3'
brew 'go' # Golang
brew 'openssl'
brew 'rbenv' # Ruby installation
brew 'ruby-build' # Ruby installation
brew 'wget'
brew 'youtube-dl'
brew 'awscli'
brew 'curl'
brew 'docker'
brew 'elixir'
brew 'erlang'
brew 'ffmpeg'
brew 'git'
brew 'heroku/brew/heroku'
brew 'httpie'
brew 'nmap'
brew 'mysql'
brew 'python'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'redis'
#brew 'rmtrash'
brew 'rust'
brew 's3cmd'
brew 'tree'
brew 'upx'
brew 'vim'
brew 'watch'
brew 'zsh'
brew 'node'
brew 'npm'
brew 'mas' # Homebrew support Mac App Store
brew 'subliminal' # Subtitles downloader
brew 'arp-scan'
brew 'fzf'
brew 'fd'
brew 'the_silver_searcher'
brew 'tig'
brew 'pgcli'
brew 'glances'
brew 'ipython'
brew 'lolcat'
brew 'tldr'
brew 'diff-so-fancy'
brew 'tmux'
brew 'dockutil' # For installing dock preferences
brew 'mackup' # Backup application preferences
brew 'htop' # View processes cpu, ram, ...
brew 'mediainfo' # View files formats
brew 'duti' # Change defaults apps for file extensions
brew 'progress' # Progress for cp, tar, dd, ...
brew 'ssh-copy-id' # For copy ssh public keys to servers
brew 'zsh-syntax-highlighting' # ZSH Plugin for syntax highlighting
brew 'zsh-autosuggestions' # ZSH Plugin for syntax autosuggestions
brew 'balena-cli' # For balena.io
brew 'php'
brew 'virtualenv'
brew 'pipenv'
brew 'yarn'
brew 'mingw-w64' # Windows cross compilers
brew 'k6'
brew 'hey'
brew 'nakabonne/ali/ali'
brew 'bat'
brew 'mailhog'
brew 'http-toolkit'
brew 'exa'
brew 'dog'

# Applications
cask 'google-chrome'
cask 'handbrake'
cask 'slack'
cask 'postico'
cask 'postman'
cask 'sketch'
cask 'sequel-pro'
cask 'calibre'
cask 'dropbox'
cask 'iterm2'
cask 'intellij-idea'
cask 'clion'
cask 'pycharm'
cask 'phpstorm'
cask 'rider'
cask 'rubymine'
cask 'webstorm'
cask 'goland'
cask 'spotify'
cask 'superduper'
cask 'the-unarchiver'
cask 'textmate'
cask 'vlc'
cask 'maintenance'
cask 'basecamp'
cask 'imageoptim' # Optimize jpeg images
cask 'imagealpha' # Optimize png images
cask 'mactex' # LaTeX for Mac
cask 'visual-studio-code'
cask 'logitech-options' # Logitech Mx Master
cask 'balenaetcher' # Flash usb and SD Cards
cask 'chromedriver'
cask 'anaconda'
cask 'poedit'
cask 'anki'
cask 'docker'
cask 'darktable'
cask 'sublime-text'
cask 'dash' # Software API documentation
cask 'unity'
cask 'postgres-unofficial'
cask 'dotnet'
cask 'iina'
cask 'transmission'
cask 'tunnelblick'

# Mac App Store Applications
mas 'Xcode', id: 497799835
mas 'Pages', id: 409201541
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'iMovie', id: 408981434
mas 'Pocket', id: 568494494
#mas 'Pixelmator', id: 407963104
mas 'LastPass', id: 926036361
mas 'Todoist: Organize your life', id: 585829637
mas 'Magnet', id: 441258766
mas 'Encrypto: Secure Your Files', id: 935235287
