cask_args appdir: '/Applications'

tap 'heroku/brew'

# Libraries & Utilities
brew 'stow' # for nokogiri
brew 'libxml2' # for nokogiri
brew 'coreutils'
brew 'sqlite3'
brew 'go' # Golang
brew 'openssl'
brew 'rbenv' # Ruby installation
brew 'ruby-build' # Ruby installation
brew 'wget'
brew 'yt-dlp' # (reemplaza a youtube-dl, abandonado)
brew 'awscli'
brew 'curl'
brew 'elixir'
brew 'erlang'
brew 'ffmpeg'
brew 'git'
brew 'heroku/brew/heroku'
brew 'httpie'
brew 'nmap'
brew 'mysql'
brew 'python'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'redis'
brew 'postgresql@16' # (la formula sin versión fue renombrada)
#brew 'rmtrash'
#brew 'rust'
brew 's3cmd'
brew 'tree'
brew 'upx'
brew 'vim'
brew 'watch'
brew 'zsh'
brew 'node' # (npm viene incluido con node)
brew 'mas' # Homebrew support Mac App Store
brew 'subliminal' # Subtitles downloader
brew 'arp-scan'
brew 'fzf'
brew 'fd'
brew 'the_silver_searcher'
brew 'tig'
brew 'pgcli'
brew 'glances'
brew 'ipython'
brew 'lolcat'
brew 'tldr'
brew 'diff-so-fancy'
brew 'tmux'
brew 'dockutil' # For installing dock preferences
brew 'htop' # View processes cpu, ram, ...
brew 'mediainfo' # View files formats
brew 'duti' # Change defaults apps for file extensions
brew 'progress' # Progress for cp, tar, dd, ...
brew 'ssh-copy-id' # For copy ssh public keys to servers
brew 'zsh-syntax-highlighting' # ZSH Plugin for syntax highlighting
brew 'zsh-autosuggestions' # ZSH Plugin for syntax autosuggestions
brew 'balena-cli' # For balena.io
brew 'php'
brew 'virtualenv'
brew 'pipenv'
brew 'pipx'
brew 'poetry'
brew 'yarn'
brew 'mingw-w64' # Windows cross compilers
brew 'k6'
brew 'hey'
brew 'nakabonne/ali/ali'
brew 'bat'
brew 'mailpit' # (reemplaza a mailhog, deprecado)
brew 'eza' # (reemplaza a exa, abandonado)
brew 'dog'
brew 'navi'
brew 'nvm'
brew 'wakeonlan' # For the homelab SwiftBar plugin (Wake on LAN)
brew 'terminal-notifier' # Notifications for the homelab SwiftBar plugin
# Optimizacion de imagenes por CLI (reemplazan a imageoptim-cli, abandonado)
brew 'oxipng' # PNG lossless (rapido, multihilo)
brew 'jpegoptim' # JPEG
brew 'pngquant' # PNG lossy (equivale a ImageAlpha)
brew 'gifsicle' # GIF

# Applications
cask 'google-chrome'
cask 'handbrake'
cask 'slack'
cask 'postico'
cask 'postman'
cask 'sketch'
cask 'sequel-ace' # (reemplaza a sequel-pro, abandonado)
cask 'calibre'
cask 'dropbox'
cask 'iterm2'
cask 'intellij-idea'
cask 'clion'
cask 'pycharm'
cask 'phpstorm'
cask 'rider'
cask 'rubymine'
cask 'webstorm'
cask 'goland'
cask 'spotify'
cask 'superduper'
cask 'the-unarchiver'
cask 'textmate'
cask 'vlc'
cask 'maintenance'
cask 'basecamp'
cask 'mactex' # LaTeX for Mac
cask 'visual-studio-code'
cask 'logi-options-plus' # Logitech Mx Master (reemplaza a logitech-options, discontinuada)
cask 'balenaetcher' # Flash usb and SD Cards
cask 'anaconda'
cask 'poedit'
cask 'anki'
cask 'docker-desktop' # Docker Desktop (el cask 'docker' quedo como stub vacio)
cask 'darktable'
cask 'sublime-text'
cask 'dash' # Software API documentation
cask 'unity'
cask 'postgres-unofficial'
cask 'dotnet-sdk' # SDK .NET (el cask 'dotnet' quedo como stub vacio; el SDK incluye runtime)
cask 'iina'
cask 'transmission'
cask 'tunnelblick'
cask 'appcleaner'
cask 'http-toolkit' # (es cask, no formula)
cask 'swiftbar' # Menubar plugins (homelab plugin)
cask 'arc' # Navegador Arc
cask 'cursor' # Editor con IA
cask 'warp' # Terminal
cask 'cloudflare-warp' # VPN/DNS de Cloudflare
cask 'rescuetime' # Seguimiento de tiempo
cask 'raspberry-pi-imager' # Grabar imagenes de Raspberry Pi
cask 'android-studio' # IDE Android
cask 'jetbrains-gateway' # Desarrollo remoto JetBrains
cask 'postgres-app' # PostgreSQL.app (postgresapp.com)
cask 'cyberduck' # Cliente FTP/SFTP/S3
cask 'firefox' # Navegador Firefox
cask 'zoom' # Videollamadas
cask 'microsoft-teams' # Videollamadas/chat
cask 'anydesk' # Escritorio remoto
cask 'wireshark' # Analizador de red
cask 'autofirma' # Firma electronica (Gobierno de Espana)
cask 'remote-desktop-manager' # Gestor de conexiones remotas
cask 'unity-hub' # Gestor de versiones de Unity
cask 'ha-menu' # Home Assistant en la barra de menu
cask 'macdown' # Editor Markdown
cask 'telegram' # Mensajeria
cask 'ngrok' # Tuneles a localhost
cask 'rustrover' # IDE Rust de JetBrains

# Mac App Store Applications
mas 'Xcode', id: 497799835
mas 'Pages', id: 409201541
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'iMovie', id: 408981434
mas 'LastPass', id: 926036361
mas 'Todoist: Organize your life', id: 585829637
mas 'Magnet', id: 441258766
mas 'Encrypto: Secure Your Files', id: 935235287
mas 'Pixelmator Pro', id: 1289583905
mas 'CopyLess 2', id: 993841014
mas 'Developer', id: 640199958 # Apple Developer
mas 'Tailscale', id: 1475387142
mas 'WhatsApp', id: 310633997
mas 'Windows App', id: 1295203466
mas 'WireGuard', id: 1451685025
